<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2018/1/28
 * Time: 19:33
 */
/**
 * 状态
 */
return [
    //开启
    'open'  => 1,
    //关闭
    'close' => 0,
    //审核
    'wait'  => 1,
    //通过
    'true'  => 2,
    //不通过
    'false' => 3,
    /*若有其他需要请另行设置 不要与上面发生冲突*/
    'order_sta' => [
        0=>'未付款',1=>'已取消',2=>'已付款等待商家接单',3=>'商家接单 正在备餐（等待骑手接单）',4=>'骑手待取货',
        5=>'骑手配送中（带送达）',6=>'已送达（待评价）',7=>'催单',8=>'用户申请退款',9=>'商家退款',10=>'系统派单（骑手待确认）',
    ],
    //ajax code
    'yes' => 1,
    'no'  => 0,
];